In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Salary_Data.csv')

In [3]:
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [4]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [7]:
df.loc[:, 'YearsExperience'] = df['YearsExperience'].fillna('Unknown')
df.loc[:, 'Salary'] = df['Salary'].fillna('Unknown')

In [8]:
print(df.isnull().sum())

YearsExperience    0
Salary             0
dtype: int64